In [39]:
import pandas as pd

In [40]:
zam_liberec = pd.read_csv("zam_liberec.csv").dropna()
zam_plzen = pd.read_csv("zam_plzeň.csv").dropna()
zam_praha = pd.read_csv("zam_praha.csv").dropna()
zam_liberec["mesto"] = "Liberec"
zam_plzen["mesto"] = "Plzeň"
zam_praha["mesto"] = "Praha"

In [41]:
zamestnanci = pd.concat([zam_liberec, zam_plzen, zam_praha])
zamestnanci.head()

       jmeno    prijimeni   telefonni_cislo  cislo_zamestnance    mesto
0       Nela      Šťastná       728 454 176                 83  Liberec
1    Heather      Marková       604 404 522                 84  Liberec
2     Krista  Procházková  +421 50 444 5544                 85  Liberec
3   Jennifer        Brown       775 545 190                 86  Liberec
4  Ladislava    Blackwell  +421 913 487 200                 87  Liberec

In [42]:
platy = pd.read_csv("platy_2021_02.csv").dropna()
platy.head()

   cislo_zamestnance     plat
0                  3  54900.0
1                  6  54800.0
2                  7  36400.0
3                  8  47900.0
4                 16  34200.0

In [47]:
zam_platy = pd.merge(zamestnanci, platy, how="outer", left_on=["cislo_zamestnance"], right_on=["cislo_zamestnance"])
zam_platy.head()

,jmeno,prijimeni,telefonni_cislo,cislo_zamestnance,mesto,plat
0,Nela,Šťastná,728 454 176,83,Liberec,46500.0
1,Heather,Marková,604 404 522,84,Liberec,38600.0
2,Krista,Procházková,+421 50 444 5544,85,Liberec,44200.0
3,Jennifer,Brown,775 545 190,86,Liberec,NaN
4,Ladislava,Blackwell,+421 913 487 200,87,Liberec,49900.0

In [44]:
zam_platy.shape

(56, 6)

In [45]:
platy.shape

(43, 2)

In [46]:
zamestnanci.shape

(56, 5)

In [48]:
bez_platu = zam_platy[zam_platy["plat"].isnull()]
bez_platu.shape

(13, 6)

In [60]:
import csv
bez_platu = "nezamestnani.csv"
with open(bez_platu, mode="w", newline="", encoding="utf-8") as nezamestnani:
    writer = csv.writer(nezamestnani)
    writer.writerows(bez_platu)

In [51]:
zam_platy["plat"].mean()

43872.09302325582

In [52]:
vykazy = pd.read_csv("vykazy.csv").dropna()
vykazy.head()

         date  hours project  emloyee_id
0  2021-02-01    2.5     F30          13
1  2021-02-01    3.4     W05          70
2  2021-02-01    2.1     JL9          72
3  2021-02-01    5.2     F30           3
4  2021-02-01    2.4     TE1          54

In [53]:
vykazy.groupby("project")["hours"].mean()

project
F30    4.300000
JL9    2.100000
TE1    3.200000
W05    4.357143
YLI    3.444444
Name: hours, dtype: float64

In [54]:
zam_vykazy = pd.merge(zamestnanci, vykazy, how="outer", left_on=["cislo_zamestnance"], right_on=["emloyee_id"])
zam_vykazy.head()

,jmeno,prijimeni,telefonni_cislo,cislo_zamestnance,mesto,date,hours,project,emloyee_id
0,Nela,Šťastná,728 454 176,83,Liberec,2021-02-01,4.1,TE1,83.0
1,Heather,Marková,604 404 522,84,Liberec,2021-02-01,2.7,YLI,84.0
2,Krista,Procházková,+421 50 444 5544,85,Liberec,NaN,NaN,NaN,NaN
3,Jennifer,Brown,775 545 190,86,Liberec,2021-02-03,4.6,TE1,86.0
4,Jennifer,Brown,775 545 190,86,Liberec,2021-02-03,5.4,YLI,86.0

In [56]:
zam_vykazy.groupby("mesto")["hours"].mean()

mesto
Liberec    4.00000
Plzeň      3.90000
Praha      3.59375
Name: hours, dtype: float64